wuxiaotian2019/az65mcu_gd32e235kbu6/GD/src/drivers/lcd/gd32e235c_lcd_eval.c
    LCD_RST_SET;
    delay_1ms(120);
}

/*!
    \brief      configure the hardware LCD_ID pin (PB4) as GPIO input
                the LCD module ties this pin low (GC9309) or high (ST7789M),
                so no internal pull resistor is used
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void lcd_id_gpio_init(void)
{
    rcu_periph_clock_enable(RCU_GPIOB);
    gpio_mode_set(LCD_ID_GPIO, GPIO_MODE_INPUT, GPIO_PUPD_NONE, LCD_ID_PIN);
}

/*!
    \brief      detect the connected LCD supplier from the hardware LCD_ID pin
                PB4 = 0 -> GC9309 (1st source)
                PB4 = 1 -> ST7789M (2nd source)
    \param[in]  none
    \param[out] none
    \retval     detected lcd type
*/
lcd_type_t lcd_detect(void)
{
    if(RESET == gpio_input_bit_get(LCD_ID_GPIO, LCD_ID_PIN)) {
        g_lcd_type = LCD_TYPE_GC9309;
    } else {
        g_lcd_type = LCD_TYPE_ST7789;
    }

    return g_lcd_type;
}

/*!
    \brief      get the LCD type resolved by the last lcd_detect() call
    \param[in]  none
    \param[out] none
    \retval     current lcd type
*/
lcd_type_t lcd_get_type(void)
{
    return g_lcd_type;
}


/*!
    \brief      lcd init sequence for GC9309
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void lcd_init_gc9309(void)
{
    /* write the register address 0xCB*/
    lcd_write_index(0xfe);

    lcd_write_index(0xef);

    lcd_write_index(0x80);
    lcd_write_data(0xc0);

    lcd_write_index(0x81);
    lcd_write_data(0x01);

    lcd_write_index(0x82);
    lcd_write_data(0x07);

    lcd_write_index(0x83);
    lcd_write_data(0x38);

    lcd_write_index(0x88);
    lcd_write_data(0x64);

    lcd_write_index(0xb4);
    lcd_write_data(0x08);

    lcd_write_index(0x89);
    lcd_write_data(0x86);

    lcd_write_index(0x8b);
    lcd_write_data(0x3c);

    lcd_write_index(0x8d);
    lcd_write_data(0x51);

    lcd_write_index(0x8e);
    lcd_write_data(0x70);

    lcd_write_index(0x36);
    lcd_write_data(0x48);

    lcd_write_index(0x3a);
    lcd_write_data(0x05);

    lcd_write_index(0xbf);
    lcd_write_data(0x1f);

    lcd_write_index(0x7d);
    lcd_write_data(0x45);
    lcd_write_data(0x06);

    lcd_write_index(0xee);
    lcd_write_data(0x00);
    lcd_write_data(0x06);

    lcd_write_index(0xf4);
    lcd_write_data(0x53);

    lcd_write_index(0xf6);
    lcd_write_data(0x07);
    lcd_write_data(0x08);

    lcd_write_index(0x70);
    lcd_write_data(0x4f);
    lcd_write_data(0x4f);

    lcd_write_index(0x71);
    lcd_write_data(0x12);
    lcd_write_data(0x20);

    lcd_write_index(0x72);
    lcd_write_data(0x12);
    lcd_write_data(0x20);

    lcd_write_index(0xb5);
    lcd_write_data(0x50);

    lcd_write_index(0xba);
    lcd_write_data(0x00);

    lcd_write_index(0xec);
    lcd_write_data(0x71);

    lcd_write_index(0x7b);
    lcd_write_data(0x00);
    lcd_write_data(0x0d);

    lcd_write_index(0x7c);
    lcd_write_data(0x0d);
    lcd_write_data(0x03);

    lcd_write_index(0xf5);
    lcd_write_data(0x02);
    lcd_write_data(0x10);
    lcd_write_data(0x12);

    lcd_write_index(0xf0);
    lcd_write_data(0x08);
    lcd_write_data(0x0c);
    lcd_write_data(0x0b);
    lcd_write_data(0x09);
    lcd_write_data(0x03);
    lcd_write_data(0x33);
    lcd_write_data(0x49);
    lcd_write_data(0x6c);
    lcd_write_data(0x9c);
    lcd_write_data(0x2e);
    lcd_write_data(0x30);
    lcd_write_data(0x4f);

    lcd_write_index(0xf1);
    lcd_write_data(0x08);
    lcd_write_data(0x0c);
    lcd_write_data(0x0b);
    lcd_write_data(0x06);
    lcd_write_data(0x05);
    lcd_write_data(0x33);
    lcd_write_data(0x4a);
    lcd_write_data(0xdb);
    lcd_write_data(0x8f);
    lcd_write_data(0x2c);
    lcd_write_data(0x2c);
    lcd_write_data(0x9f);

    lcd_write_index(0x66);
    lcd_write_data(0x15);

    lcd_write_index(0x67);
    lcd_write_data(0x1d);

    lcd_write_index(0x68);
    lcd_write_data(0x1d);

    lcd_write_index(0xca);
    lcd_write_data(0x0f);

    lcd_write_index(0xe8);
    lcd_write_data(0xf0);

    lcd_write_index(0xcb);
    lcd_write_data(0x06);

    lcd_write_index(0xb6);
    lcd_write_data(0x5c);
    lcd_write_data(0x40);
    lcd_write_data(0x40);

    lcd_write_index(0xcc);
    lcd_write_data(0x33);

    lcd_write_index(0xcd);
    lcd_write_data(0x33);

    lcd_write_index(0x35);
    lcd_write_data(0x00);

    lcd_write_index(0x44);
    lcd_write_data(0x00);
    lcd_write_data(0x0a);

    /* exit sleep */
    lcd_write_index(0x11);
    delay_1ms(80);

    lcd_write_index(0xe8);
    lcd_write_data(0xa0);

    lcd_write_index(0xe8);
    lcd_write_data(0xf0);

    lcd_write_index(0xfe);
    lcd_write_index(0xee);

    /* display on */
    lcd_write_index(0x29);
    lcd_write_index(0x2c);
    delay_1ms(10);

    LCD_CS_SET;
}

/*!
    \brief      lcd init sequence for ST7789
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void lcd_init_st7789(void)
{
    /* exit sleep */
    lcd_write_index(0x11);
    delay_1ms(120);

    lcd_write_index(0x36);
    lcd_write_data(0x00);

    lcd_write_index(0x3A);
    lcd_write_data(0x05);

    lcd_write_index(0xB2);
    lcd_write_data(0x0C);
    lcd_write_data(0x0C);
    lcd_write_data(0x00);
    lcd_write_data(0x33);
    lcd_write_data(0x33);

    lcd_write_index(0xB7);
    lcd_write_data(0x55);

    lcd_write_index(0xBB);
    lcd_write_data(0x20);

    lcd_write_index(0xC0);
    lcd_write_data(0x2C);

    lcd_write_index(0xC2);
    lcd_write_data(0x01);

    lcd_write_index(0xC3);
    lcd_write_data(0x13);

    lcd_write_index(0xC6);
    lcd_write_data(0x12);

    lcd_write_index(0xD0);
    lcd_write_data(0xA7);

    lcd_write_index(0xD0);
    lcd_write_data(0xA4);
    lcd_write_data(0xA1);

    lcd_write_index(0xD6);
    lcd_write_data(0xA1);

    lcd_write_index(0xE0);
    lcd_write_data(0xF0);
    lcd_write_data(0x04);
    lcd_write_data(0x07);
    lcd_write_data(0x09);
    lcd_write_data(0x08);
    lcd_write_data(0x16);
    lcd_write_data(0x26);
    lcd_write_data(0x33);
    lcd_write_data(0x3D);
    lcd_write_data(0x39);
    lcd_write_data(0x15);
    lcd_write_data(0x13);
    lcd_write_data(0x27);
    lcd_write_data(0x2F);

