wuxiaotian2019/az65mcu_gd32e235kbu6/GD/src/drivers/lcd/gd32e235c_lcd_eval.c
    lcd_write_index(0xE1);
    lcd_write_data(0xF0);
    lcd_write_data(0x02);
    lcd_write_data(0x05);
    lcd_write_data(0x07);
    lcd_write_data(0x06);
    lcd_write_data(0x01);
    lcd_write_data(0x26);
    lcd_write_data(0x33);
    lcd_write_data(0x3D);
    lcd_write_data(0x36);
    lcd_write_data(0x13);
    lcd_write_data(0x15);
    lcd_write_data(0x28);
    lcd_write_data(0x30);

    lcd_write_index(0x35);
    lcd_write_data(0x00);

    lcd_write_index(0x21);

    /* display on */
    lcd_write_index(0x29);
    lcd_write_index(0x2C);

    LCD_CS_SET;
}

/*!
    \brief      lcd init with supplier auto-detection
                detect runs after hardware reset and before any panel init
                command; the panel init sequence is selected by the result
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lcd_init(void)
{
    spi1_init();
    lcd_id_gpio_init();

    LCD_CS_CLR;
    lcd_reset();

    /* supplier selected by the hardware LCD_ID pin (PB4), then run the
       matching init sequence; CS stays low for the whole init as before */
    switch(lcd_detect()) {
    case LCD_TYPE_GC9309:
        lcd_init_gc9309();
        break;

    case LCD_TYPE_ST7789:
        lcd_init_st7789();
        break;

    default:
        /* not reachable with a 2-state strap pin, kept for safety */
        LCD_CS_SET;
        break;
    }
}

/*!
    \brief      set lcd display region
    \param[in]  x_start: the x position of the start point
    \param[in]  y_start: the y position of the start point
    \param[in]  x_end: the x position of the end point
    \param[in]  y_end: the y position of the end point
    \param[out] none
    \retval     none
*/
void lcd_set_region(uint16_t x_start, uint16_t y_start, uint16_t x_end, uint16_t y_end)
{
    LCD_CS_CLR;

    /* write the register address 0x2A*/
    lcd_write_index(0x2A);
    lcd_write_data_16bit(x_start >> 8, x_start);
    lcd_write_data_16bit(x_end >> 8, x_end);

    /* write the register address 0x2B*/
    lcd_write_index(0x2B);
    lcd_write_data_16bit(y_start >> 8, y_start);
    lcd_write_data_16bit(y_end >> 8, y_end);

    /* write the register address 0x2C*/
    lcd_write_index(0x2C);
    LCD_CS_SET;
}

/*!
    \brief      set the start display point of lcd
    \param[in]  x: the x position of the start point
    \param[in]  y: the y position of the start point
    \param[out] none
    \retval     none
*/
void lcd_set_xy(uint16_t x, uint16_t y)
{
    /* write the register address 0x2A*/
    lcd_write_index(0x2A);
    lcd_write_data_16bit(x >> 8, x);

    /* write the register address 0x2B*/
    lcd_write_index(0x2B);
    lcd_write_data_16bit(y >> 8, y);

    /* write the register address 0x2C*/
    lcd_write_index(0x2C);
}

/*!
    \brief      draw a point on the lcd
    \param[in]  x: the x position of the point
    \param[in]  y: the y position of the point
    \param[in]  data: write the register data
    \param[out] none
    \retval     none
*/
void lcd_draw_point(uint16_t x, uint16_t y, uint16_t data)
{
    lcd_set_xy(x, y);
    lcd_write_data(data >> 8);
    lcd_write_data(data);
}

/*!
    \brief      clear the lcd
    \param[in]  color: lcd display color
    \param[out] none
    \retval     none
*/
void lcd_clear(uint16_t color)
{
    unsigned int i, m;
    /* set lcd display region */
    lcd_set_region(0, 0, X_MAX_PIXEL - 1, Y_MAX_PIXEL - 1);
    LCD_RS_SET;

    LCD_CS_CLR;
    for(i = 0; i < Y_MAX_PIXEL; i ++) {
        for(m = 0; m < X_MAX_PIXEL; m ++) {
            spi_write_byte(SPI1, color >> 8);
            spi_write_byte(SPI1, color);
        }
    }
    LCD_CS_SET;
}

/*!
    \brief      bgr to rgb format conversion
    \param[in]  c: bgr color value
    \param[out] none
    \retval     rgb color value
*/
uint16_t lcd_bgr2rgb(uint16_t c)
{
    uint16_t r, g, b, rgb;
    b = (c >> 0) & 0x1f;
    g = (c >> 5) & 0x3f;
    r = (c >> 11) & 0x1f;
    rgb = (b << 11) + (g << 5) + (r << 0);
    return(rgb);
}

/*!
    \brief      gui circle
    \param[in]  x: the x position of the start point
    \param[in]  y: the y position of the start point
    \param[in]  r: the radius of circle
    \param[in]  fc: display color of font
    \param[out] none
    \retval     none
*/
void lcd_circle_draw(uint16_t x, uint16_t y, uint16_t r, uint16_t fc)
{
    unsigned short a, b;
    int c;
    a = 0;
    b = r;
    c = 3 - 2 * r;
    LCD_CS_CLR;

    while(a < b) {
        /* draw points on the lcd */
        lcd_draw_point(x + a, y + b, fc);
        lcd_draw_point(x - a, y + b, fc);
        lcd_draw_point(x + a, y - b, fc);
        lcd_draw_point(x - a, y - b, fc);
        lcd_draw_point(x + b, y + a, fc);
        lcd_draw_point(x - b, y + a, fc);
        lcd_draw_point(x + b, y - a, fc);
        lcd_draw_point(x - b, y - a, fc);

        if(c < 0) {
            c = c + 4 * a + 6;
        } else {
            c = c + 4 * (a - b) + 10;
            b -= 1;
        }
        a += 1;
    }
    if(a == b) {
        /* draw points on the lcd */
        lcd_draw_point(x + a, y + b, fc);
        lcd_draw_point(x + a, y + b, fc);
        lcd_draw_point(x + a, y - b, fc);
        lcd_draw_point(x - a, y - b, fc);
        lcd_draw_point(x + b, y + a, fc);
        lcd_draw_point(x - b, y + a, fc);
        lcd_draw_point(x + b, y - a, fc);
        lcd_draw_point(x - b, y - a, fc);
    }
    LCD_CS_SET;
}

/*!
    \brief      gui draw line
    \param[in]  x0: the x position of the start point
    \param[in]  y0: the y position of the start point
    \param[in]  x1: the x position of the end point
    \param[in]  y1: the y position of the end point
    \param[in]  color: lcd display color
    \param[out] none
    \retval     none
*/
void lcd_line_draw(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t color)
{
    /* - difference in x's
       - difference in y's
       - dx,dy * 2
       - amount in pixel space to move during drawing
       - amount in pixel space to move during drawing
       - the discriminant i.e. error i.e. decision variable
       - used for looping */
    int dx, dy, dx2, dy2, x_inc, y_inc, error, index;

