wuxiaotian2019/az65mcu_gd32e235kbu6/GD/src/drivers/lcd/gd32e235c_lcd_eval.c
    LCD_CS_CLR;
    for(i = 0; i < 32; i ++) {
        for(j = 0; j < 4; j++) {
            c = *(sz32 + num * 32 * 4 + i * 4 + j);
            for(k = 0; k < 8; k ++) {
                if(c & (0x80 >> k))
                    /* draw a point on the lcd */
                {
                    lcd_draw_point(x + j * 8 + k, y + i, fc);
                } else {
                    if(fc != bc)
                        /* draw a point on the lcd */
                    {
                        lcd_draw_point(x + j * 8 + k, y + i, bc);
                    }
                }
            }
        }
    }
    LCD_CS_SET;
}

/*!
    \brief      display image from buffer (RGB565 format)
    \param[in]  x: the x position of the start point
    \param[in]  y: the y position of the start point
    \param[in]  width: image width in pixels
    \param[in]  height: image height in pixels
    \param[in]  image_data: pointer to image data buffer (RGB565 format, size = width * height * 2)
    \param[out] none
    \retval     none
*/
void lcd_draw_image(uint16_t x, uint16_t y, uint16_t width, uint16_t height, const uint8_t *image_data)
{
    uint32_t i, j;
    uint16_t color;
    
    /* set lcd display region */
    lcd_set_region(x, y, x + width - 1, y + height - 1);
    
    LCD_CS_CLR;
    LCD_RS_SET;  /* data mode */
    
    /* write pixel data */
    /* Fix vertical flip by writing rows in reverse order */
    for(j = 0; j < height; j++) {
        uint32_t row_offset = (height - 1 - j) * width * 2; /* Calculate row offset in reverse order */
        for(i = 0; i < width; i++) {
            /* RGB565 format: high byte first, then low byte */
            color = image_data[row_offset + i * 2] | (image_data[row_offset + i * 2 + 1] << 8);
            // Swap red and blue components (BBBBBGGGGGGRRRRR to RRRRRGGGGGGBBBBB)
            //color = ((color & 0x1F) << 11) | (color & 0x07E0) | ((color >> 11) & 0x1F);

            spi_write_byte(SPI1, color >> 8);   /* high byte */
            spi_write_byte(SPI1, color & 0xFF); /* low byte */
        }
    }

    LCD_CS_SET;
}

void Set_Lcd_High_Resistance(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);
    gpio_mode_set(GPIOA, GPIO_MODE_ANALOG, GPIO_PUPD_NONE, GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15);
    gpio_mode_set(GPIOB, GPIO_MODE_ANALOG, GPIO_PUPD_NONE, GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4);
}